Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཤ་ར་དྭ་ཏིའི་བུ་སེམས་ཅན་རྣམས་རྨོངས་པས་ཕུང་པོ་ཞེས་བྱ་བ་འམ། སྐྱེ་མཆེད་ཅེས་བྱ་བ་འམ། ཁམས་ཤེས་བྱ་བ་འམ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཞེས་བྱ་བ་འམ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཆོས་ཤེས་བྱ་བར་མངོན་པར་ཞེན་པ་མ་གཏོགས་པར་ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པའོ།
en: Śāradvatīputra, apart from the delusion of beings that is fixated on phenomena such as ‘aggregates,’ ‘sense fields,’ ‘sensory elements,’ or ‘links of dependent origination,’ all phenomena are nonentities.

source: །སྲོག་མེད་པའོ། །སྲོག་དང་བྲལ་བའོ།
en: They are without life forms and devoid of life.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དོ།
en: They are of the essential nature of nonentity.

source: །རང་བཞིན་གྱིས་སྟོང་བའོ།
en: They are empty of inherent existence.

source: །རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་བའོ། །དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། རང་བཞིན་སྟོང་པ་ཉིད་དང་། རང་གི་མཚན་ཉིད་སྟོང་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ནས།
en: So it is that when bodhisattva great beings practice the perfection of wisdom, they observe that all phenomena are of the essential nature of nonentity, empty of inherent existence, and empty of intrinsic defining characteristics.

source: སྒྱུ་མའི་མཁན་པོ་ལྟ་བུའི་ལུས་བྱིན་གྱིས་བརླབས་ནས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ།
en: Conjuring up their body in the manner of an illusionist, they teach the Dharma to beings.

source: སེམས་ཅན་གང་སེར་སྣ་ཅན་དུ་གྱུར་པ་དེ་དག་ལ་སྦྱིན་པའི་གཏམ་བྱེད་དོ།
en: To those beings who have become miserly, they speak of generosity.

source: །ཚུལ་ཁྲིམས་ངན་པ་ཅན་རྣམས་ལ་ཚུལ་ཁྲིམས་ཀྱི་གཏམ་བྱེད་དོ།
en: To those of poor ethical discipline, they converse on ethical discipline.

source: །གནོད་སེམས་ཅན་རྣམས་ལ་བཟོད་པའི་གཏམ་བྱེད་དོ།
en: To beings with malice, they speak of tolerance.

source: །ལེ་ལོ་ཅན་རྣམས་ལ་བརྩོན་འགྲུས་ཀྱི་གཏམ་བྱེད་དོ།
en: To those who are indolent, they speak of perseverance.

source: །སེམས་གཡེང་བ་རྣམས་ལ་ཏིང་ངེ་འཛིན་གྱི་གཏམ་བྱེད་དོ།
en: To those of distracted mind, they speak of meditative stability.

source: །ཤེས་རབ་འཆལ་བ་རྣམས་ལ་ཤེས་རབ་ཀྱི་གཏམ་བྱེད་དོ། །གང་གི་ཚེ་སེམས་ཅན་དེ་དག་སྦྱིན་པ་ལ་བཀོད་པར་གྱུར་པ་དང་།
en: To those of stupidity, they speak of wisdom.

source: ཚུལ་ཁྲིམས་དང་བཟོད་པ་དང་བརྩོན་འགྲུས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་ལ་བཀོད་པར་གྱུར་པ་དེའི་ཚེ། དེ་ལས་གོང་དུ་སེམས་ཅན་དེ་དག་ལ་འཕགས་པའི་གཏམ་འབྱུང་བར་འགྱུར་བ་གང་གིས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པར་འགྱུར་བ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ཐོབ་པར་འགྱུར་བ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཐོབ་པར་འགྱུར་བ་དང་། དགྲ་བཅོམ་པ་ཉིད་ཐོབ་པར་འགྱུར་བ་དང་། རང་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་བ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཐོབ་པར་འགྱུར་བ་དེ་ལྟ་བུའི་གཏམ་བྱེད་དོ། །གསོལ་པ།
en: And once those beings have been established in generosity, and established in ethical discipline, tolerance, perseverance, meditative stability, and wisdom, they speak to them about sublime matters, through which they will attain the fruit of entering the stream to nirvāṇa, they will attain the fruit of being destined for only one more rebirth, they will attain the fruit of no longer being subject to rebirth, they will attain arhatship, they will attain individual enlightenment, and they will attain all-aspect omniscience.” “

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དེ་ལྟར་སེམས་ཅན་མ་མཆིས་ཤིང་ཡང་དག་པར་མ་མཆིས་པ་རྣམས་སྦྱིན་པ་ལ་སྦྱོར། ཚུལ་ཁྲིམས་དང་བཟོད་པ་དང་བརྩོན་འགྲུས་དང་ཏིང་ངེ་འཛིན་དང་ཤེས་རབ་ལ་སྦྱོར་ཞིང་དེ་ལས་གོང་དུ་འཕགས་པའི་གཏམ་འབྱུང་བར་འགྱུར་བ་གང་གིས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པར་འགྱུར་བ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་།
en: Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, if they converse with beings who are nonexistent and not discernible, engaging them in generosity and engaging them in ethical discipline, tolerance, perseverance, meditative stability, and wisdom, and, over and above that, converse with them on sublime matters through which they will attain the fruit of entering the stream to nirvāṇa, attain the fruit of being destined for only one more rebirth, attain the fruit of no longer being subject to rebirth, arhatship, or individual enlightenment, and attain [the goals], up to and including all-aspect omniscience, how are they not apprehensible?” {

source: དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་འཐོབ་པར་འགྱུར་བ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་འཐོབ་པར་འགྱུར་བ་དེ་ལྟ་བུའི་གཏམ་བགྱིད་ན།
en: Ki.

source: ཇི་ལྟར་དམིགས་པ་མ་མཆིས་པར་འགྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལ། དམིགས་པ་གང་ཡང་མེད་དེ།
en: VIII: 110} “Śāradvatīputra,” replied the Blessed One, “there is no apprehending at all for bodhisattva great beings who practice the perfection of wisdom.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཀུན་རྫོབ་ཀྱི་བརྡས་ཐ་སྙད་དུ་སྤྱོད་པ་མ་གཏོགས་པར་སེམས་ཅན་གང་ཡང་མི་དམིགས་ཏེ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ལྟ་སྟེ། ཀུན་རྫོབ་ཀྱི་བདེན་པ་དང་།
en: If you ask why, it is because when those bodhisattva great beings practice the perfection of wisdom, they do not apprehend any beings at all, except in conventional terms by way of relative symbols.

source: དོན་དམ་པའི་བདེན་པ་དང་། བདེན་པ་གཉིས་ལ་གནས་ནས། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཀྱང་། ཤ་ར་དྭ་ཏིའི་བུ་བདེན་པ་གཉིས་ལ་སེམས་ཅན་དུ་དམིགས་པ་མེད་དེ། སེམས་ཅན་དུ་གདགས་པ་ཡང་མེད་དོ།
en: In this regard, Śāradvatīputra, bodhisattva great beings teach the Dharma to beings, having been established in the two truths—the relative truth and the ultimate truth—but, Śāradvatīputra, in the context of the two truths beings are not apprehended, nor are beings conceived.

source: །འོན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པ་དེས་སེམས་ཅན་དེ་དག་ཚེ་འདི་ཉིད་ལ་བདག་ཏུ་མི་དམིགས་ན། གང་ཐོབ་པར་བྱ་བ་དང་། གང་གིས་ཐོབ་པར་བྱ་བ་ལྟ་ཅི་སྨོས་ཏེ།
en: On the contrary, when bodhisattva great beings practice the perfection of wisdom through skill in means, they teach the Dharma to beings through which those beings will have no apprehending of self in this very lifetime—not to mention something that they should attain or by which they should gain attainment.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །གསོལ་པ།
en: It is in this manner, Śāradvatīputra, that when bodhisattva great beings practice the perfection of wisdom, through skill in means they teach the Dharma to beings.” “

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་གང་ཡང་གཅིག་པ་འམ། ཐ་དད་པར་ཡང་མི་དམིགས།
en: Blessed Lord, bodhisattva great beings do not apprehend singularity or difference with respect to anything at all.

source: འདི་ལྟ་བུའི་གོ་ཆ་འཚལ་བ་དང་། གོ་ཆ་དེ་འཚལ་བས་འདོད་པའི་ཁམས་ན་ཡང་མི་གདའ། གཟུགས་མཆིས་པའི་ཁམས་ན་ཡང་མི་གདའ། གཟུགས་མ་མཆིས་པའི་ཁམས་ན་ཡང་མི་གདའ།
en: They don such an armor, and by donning that armor, they are not perceptible in the realm of desire, nor are they perceptible in the realm of form, nor are they perceptible in the realm of formlessness.

source: འདུས་བྱས་ཀྱི་ཁམས་དང་། འདུས་མ་བྱས་ཀྱི་ཁམས་ན་ཡང་མི་གདའ་ལ།
en: They are not perceptible, either in conditioned elements or in unconditioned elements.

source: སེམས་ཅན་རྣམས་ཁམས་གསུམ་ནས་འགྲེལ་ཅིང་སེམས་ཅན་དུའང་མི་དམིགས། སེམས་ཅན་དུ་གདགས་པ་ཡང་མི་དམིགས་པ་ནི་སྤྲོ་བ་ཆེན་པོ་དང་ལྡན་པ་སྟེ།
en: Endowed with great enthusiasm, they liberate beings from the three realms and yet they do not apprehend beings, nor do they apprehend any concept of beings.

source: སེམས་ཅན་དུ་གདགས་པ་མ་མཆིས་པས། སེམས་ཅན་བཅིངས་པ་དང་གྲོལ་བ་མ་མཆིས།
en: Since there is no concept of beings, beings are neither bound nor liberated.

source: སེམས་ཅན་བཅིངས་པ་དང་གྲོལ་བ་མ་མཆིས་པས། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་མ་མཆིས། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་མ་མཆིས་པས།
en: Since beings are neither bound nor liberated, they are neither afflicted nor purified.

source: ལམ་གྱི་རྒྱུད་རྣམས། ཐ་དད་པར་མི་དམིགས། ལམ་གྱི་རྒྱུད་རྣམས་ཐ་དད་པ་མ་མཆིས་པ་ལ་ལས་དང་ཉོན་མོངས་པ་མ་མཆིས་ཏེ།
en: Since they are neither afflicted nor purified, the minds of those on the path are not apprehended as different, and for the minds of those on the path that are not differentiated, there will be no karma or afflicted mental states.

source: ལས་དང་ཉོན་མོངས་པ་མ་མཆིས་ན། རྣམ་པར་སྨིན་པ་གང་གིས་བདག་གམ། སེམས་ཅན་འགྲོ་བ་ལྔའི་འཁོར་བ་ན་གདའ་བར་འགྱུར་བའི་རྣམ་པར་སྨིན་པ་དེ་ལྟ་བུ་ཡང་ག་ལས་མཆིས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: When there is no karma or afflicted mental states, from where could there possibly arise the maturation [of past actions] through which they themselves, or other beings, are perceptible, roaming within the five classes of living beings?” “

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: Śāradvatīputra, it is so!

source: ཚིག་ཇི་སྐད་དུ་བརྗོད་པ་བཞིན་ཏེ། གལ་ཏེ་སྔོན་སེམས་ཅན་ཞིག་བྱུང་བར་གྱུར་ལ། ཕྱིས་འབྱུང་བ་མེད་པར་གྱུར་ཏམ། འོན་ཏེ་དེ་ནི་དེ་བཞིན་དུ་སྔོན་ཡོད་པ་ལ་ཕྱིས་མེད་པར་གྱུར་ཏམ། འགྲོ་བ་ལྔའི་འཁོར་བ་སྔོན་ཡོད་ལ་ཕྱིས་མེད་པར་འགྱུར། དེ་བཞིན་གཤེགས་པ་དང་།
en: It is so,” replied the Blessed One. “

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་ཡང་འདས་པ་དེ་ལྟ་བུར་འགྱུར་ན། ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་། དེ་བཞིན་གཤེགས་པ་རྣམས་མ་བྱུང་ཡང་རུང་སྟེ། ཆོས་དེ་དག་གི་དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དེ་བཞིན་དུ་གནས་པ་སྟེ།
en: As you have said, if any being had appeared in the past but not in the future—or similarly, if any had existed in the past but not in the future—or if the tathāgatas and bodhisattvas had similarly passed away in that manner, [there would be a fault]; but, on the contrary, Śāradvatīputra, whether the tathāgatas have appeared or whether the tathāgatas have not appeared, the real nature of phenomena, the unmistaken real nature, the one and only real nature, reality, the realm of phenomena, the abiding nature of phenomena, the maturity with respect to all phenomena, the very limit of reality, and the inconceivable realm dwell in this manner.

source: དེ་ལ་བདག་ཀྱང་མེད། སེམས་ཅན་ཡང་མེད། སྲོག་ཀྱང་མེད། འགྲོ་བ་ཡང་མེད། གསོ་བ་ཡང་མེད། སྐྱེས་བུ་ཡང་མེད། གང་ཟག་ཡང་མེད། ཤེད་ཅན་ཀྱང་མེད།
en: Since in it there is no self, no being, no life form, no living being, {Ki.

source: ཤེད་བདག་ཀྱང་མེད། བྱེད་པ་པོ་ཡང་མེད། ཚོར་བ་པོ་ཡང་མེད། ཤེས་པ་པོ་ཡང་མེད། མཐོང་བ་པོ་ཡང་མེད་ན་དེ་ལ་གཟུགས་ལྟ་ག་ལ་ཡོད།
en: VIII: 111} no life, no living creature, no individual person, no human being, no person, no actor, no experiencer, no knower, and no viewer, how could physical forms possibly exist in it?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལྟ་ག་ལ་ཡོད།
en: How could feelings, perceptions, formative predispositions, or consciousness possibly exist in it?

source: སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལྟ་ག་ལ་ཡོད།
en: How could the sense fields, the sensory elements, or the links of dependent origination possibly exist in it?

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཆོས་རྣམས་ལྟ་ཡང་ག་ལ་ཡོད་དེ།
en: How could the attributes associated with the links of dependent origination possibly exist in it?

source: ཆོས་དེ་དག་མེད་ན་འགྲོ་བ་ལྔའི་འཁོར་བ་གང་ནས།
en: If these attributes are nonexistent, from what cyclic existence with its five classes of living beings could beings be liberated?

source: སེམས་ཅན་རྣམས་དགྲོལ་བར་བྱ་བ་དེ་ལྟ་བུ་དག་ལྟ་ཡང་ག་ལ་ཡོད་དེ།
en: How could such phenomena possibly exist in it? “

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། སྔོན་གྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལས་དེ་ལྟ་བུའི་ཆོས་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་དེ་དག་ཐོས་ནས་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཇུག་སྟེ།
en: In this regard, Śāradvatīputra, bodhisattva great beings, having heard from the lord buddhas of the past that such phenomena are empty of essential nature, set out for unsurpassed, complete enlightenment, for the sake of beings.

source: ཕྱིན་ཅི་ལོག་གིས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་མངོན་པར་ཞེན་པ་མ་གཏོགས་པར་སེམས་ཅན་ནམ་ཆོས་གང་ཡང་དམིགས་པ་མེད་དོ།
en: Apart from the fixation of ordinary persons, which is due to their erroneous views, they do not apprehend beings or anything at all.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དེ་ལྟ་བུའི་གོ་ཆ་ཆེན་པོ་གྱོན་ཏེ།
en: Śāradvatīputra, such is the mighty armor that bodhisattva great beings don.

source: གོ་ཆ་དེ་བགོས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་སྟེ། བདག་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་བྱ་བ་མ་ཡིན་གྱི།
en: By donning that armor, they make irreversible progress toward unsurpassed, complete enlightenment, and they think, ‘I should not fail to attain consummate buddhahood in unsurpassed, complete enlightenment!

source: གདོན་མི་ཟ་བར་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ།
en: Rather, I should absolutely attain consummate buddhahood in unsurpassed, complete enlightenment!

source: །དེ་ལྟར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་། སེམས་ཅན་རྣམས་ཀྱི་དོན་ཆོས་བཞིན་དུ་བྱས་ཏེ། དོན་བྱ་བ་དེས་སེམས་ཅན་རྣམས་ཕྱིན་ཅི་ལོག་ལས་ཡོངས་སུ་དགྲོལ་བར་བྱའོ་སྙམ་མོ།
en: Even after attaining consummate buddhahood, I should act in accordance with the Dharma for the sake of beings, and through those acts of benefit liberate beings from erroneous views!’ “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་སྒྱུ་མའི་མཁན་པོ་འམ། སྤྲུལ་པའི་སྐྱེས་བུ་ཞིག་གིས་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོར་སྤྲུལ་ཏེ། བཟའ་བ་དང་། བཅའ་བ་ཞིམ་ཞིང་ཉམས་སུ་བདེ་བ་ཤིན་དུ་མང་བས་ཚིམ་པར་བྱས་ཏེ།
en: Śāradvatīputra, this is just as if an illusionist or a phantom person were to conjure up many hundred billion trillions of living creatures and satisfy them with an abundance of delicious and pleasant food and delicacies, and, having satisfied them in that manner, were to purposefully say, ‘I have accrued much merit!

source: དེ་ལྟར་ཚིམ་པར་བྱས་ནས། བདག་གིས་ནི་བསོད་ནམས་མང་པོ་སྤེལ་ཏོ། །བདག་གིས་ནི་བསོད་ནམས་མང་པོ་སྤེལ་ཏོ་ཞེས། ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་ན།
en: I have accrued much merit!’

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེ་ལ་ལ་ལ་ཞིག་སྟོན་ཏེ་ཚིམ་པར་བྱས་པ་འམ།
en: In that case, Śāradvatīputra, do you think that anyone would be fed or satisfied?

source: ལ་ལས་བསོད་ནམས་འཕེལ་བར་བྱས་པ་ཡོད་དམ། གསོལ་པ།
en: Would anyone have accrued merit?” “

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་ལ་སྤྱོད་པ་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་ལ་སྤྱོད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་སྤྱོད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་།
en: No, Blessed Lord!” “

source: གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་ལ་སྤྱོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: Similarly, Śāradvatīputra,” continued the Blessed One, “when bodhisattva great beings, commencing from the time when they first begin to set their mind on enlightenment, indeed practice the perfections; practice all the aspects of emptiness; practice the thirty-seven factors conducive to enlightenment; practice the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, all the meditative stabilities, and all the dhāraṇī gateways; practice the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, {Ki.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱོད་པ་དང་། བྱང་ཆུབ་ཀྱི་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་པའི་ཚེ། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ། སེམས་ཅན་ལ་ལ་ཞིག་དམིགས་པར་བྱས་ཤིང་། གདུལ་བར་བྱ་བ་དེ་ལྟ་བུའི་སེམས་ཅན་གང་ཡང་མི་དམིགས་སོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: VIII: 112} and the eighteen distinct qualities of the buddhas; perfect the path of enlightenment; and refine the buddhafields, they bring beings to maturation and yet they do not apprehend any being at all, such as they might apprehend and then discipline.”

source: བམ་པོ་བདུན་ཅུ་གཉིས་པ། དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བྱང་ཆུབ་ཀྱི་ལམ་གང་ལ་སྤྱོད་དེ།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, what path of enlightenment do bodhisattva great beings practice?

source: སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བགྱི་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ཀྱི་ལམ་གང་ལགས།
en: What is the path of enlightenment of bodhisattva great beings who bring beings to maturation and refine the buddhafields?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད།
en: In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings, commencing from the time when they first begin to set their mind on enlightenment, practice the perfection of generosity.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད།
en: They practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative stability, and the perfection of wisdom.

source: ནང་སྟོང་པ་ཉིད་ལ་སྤྱོད་ཕྱི་སྟོང་པ་ཉིད་ལ་སྤྱོད་ཕྱི་ནང་སྟོང་པ་ཉིད་ལ་སྤྱོད།
en: They practice the emptiness of internal phenomena. They practice the emptiness of external phenomena. They practice the emptiness of external and internal phenomena.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: They practice [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱོད།
en: They practice the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path.

source: འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་ལ་སྤྱོད།
en: They practice the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the five extrasensory powers, all the meditative stabilities, and all the dhāraṇī gateways.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱོད་ཅིང་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ།
en: They practice the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་དག་པར་བྱེད་དོ།
en: They bring beings to maturation, and they also refine the buddhafields.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་ལགས།
en: Blessed Lord, how do bodhisattva great beings bring beings to maturation, while practicing the perfection of generosity?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་རྣམས་ལ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་སྟེ། སྦྱིན་པ་བྱིན་ནས་འདི་སྐད་དུ་འདེམས་ཤིང་རྗེས་སུ་སྟོན་ཏེ། རིགས་ཀྱི་བུ་དག་སྦྱིན་པ་ལ་གཟུང་བས་མ་འཛིན་ཅིག །
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, they dispense generosity to beings, and having given them gifts, they instruct and advise them as follows: ‘Noble children, do not acquisitively grasp this gift!

source: སྦྱིན་པ་ལ་གཟུང་བས་འཛིན་ཅིང་ལུས་གང་མངོན་པར་གྲུབ་པས་སྡུག་བསྔལ་མང་པོ་ཉམས་སུ་མྱོང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ལུས་མངོན་པར་འགྲུབ་པ་རེ།
en: By acquisitively grasping this gift and then [in the next life] assuming a physical body, you will experience many sufferings. Such is the physical body you will assume!

source: རིགས་ཀྱི་བུ་དག་འདི་ལ་དོན་དམ་པར་ན། སྦྱིན་པ་ཡང་མེད། སྦྱིན་པའི་འབྲས་བུ་ཡང་མེད། སྦྱིན་པའི་བདག་པོ་ཡང་མེད། ལེན་པ་ཡང་མེད་དེ།
en: Noble children, here in ultimate reality there is no generosity, nor is there a fruit of generosity, nor is there a donor of generosity, nor is there a recipient of generosity.

source: ཆོས་དེ་དག་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་སྟོང་པའོ།
en: All these phenomena are empty of inherent existence.

source: །རང་བཞིན་གྱིས་སྟོང་པའི་ཆོས་ནི་ལེན་པ་མེད་དོ།
en: Something that is empty of inherent existence cannot be received.

source: །རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ནི་གཟུང་དུ་མེད་པའོ་ཞེས་འདེམས་ཤིང་རྗེས་སུ་སྟོན་ཏེ།
en: Emptiness of inherent existence cannot be grasped.’ “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དེ་ལྟར་སེམས་ཅན་རྣམས་ལ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཡང་སྦྱིན་པ་མི་དམིགས་སོ།
en: Subhūti, when bodhisattva great beings practice the perfection of generosity, they dispense generosity to beings, but do not apprehend generosity.

source: །སྦྱིན་པའི་བདག་པོ་མི་དམིགས་སོ། །ལེན་པ་མི་དམིགས་སོ།
en: They do not apprehend the donor of generosity and they do not apprehend the recipient.

source: །དེ་ནི་མི་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: This is a perfection that is nonapprehensible. {Ki.

source: འདི་ལྟར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: VIII: 113} Such is the perfection of generosity.

source: །དེ་ཆོས་གསུམ་པོ་དེ་དག་ཐམས་ཅད་མི་དམིགས་པས། སེམས་ཅན་རྣམས་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ལ་སྦྱོར་རོ།
en: By not apprehending any of these three attributes—[gift, donor, or recipient]—they engage beings in the fruit of entering the stream to nirvāṇa.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་ལ་སྦྱོར་རོ།
en: They engage them in the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and arhatship.

source: །རང་བྱང་ཆུབ་ལ་སྦྱོར་རོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་སྦྱོར་རོ།
en: They engage them in individual enlightenment, and they engage them in unsurpassed, complete enlightenment. “

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ།
en: Subhūti, when bodhisattva great beings practice the perfection of generosity in that manner, they bring beings to maturation.

source: དེ་བདག་ཉིད་ཀྱང་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ངོ་། །གཞན་ཡང་སྦྱིན་པ་ལ་ཡང་དག་པར་སྐུལ་ལོ།
en: They themselves dispense generosity and they also encourage others to [practice] generosity.

source: །སྦྱིན་པའི་ལེགས་པ་རྗོད་དོ། །སེམས་ཅན་གཞན་གང་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་དེ་དག་གི་ཡང་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་དེ།
en: They praise generosity, and they also praise and take empathetic delight in other beings who dispense generosity.
